taskt/Core/ApplicationSettings/SafeHttpServerClientApplicationSettings.dot
digraph "SafeHttpServerClientApplicationSettings" {
"SafeHttpServerClientApplicationSettings" -> "SafeApplicationSettings";
"SafeApplicationSettings" -> "IApplicationSettings";
}
