taskt/Core/ApplicationSettings/SafeHttpServerClientApplicationSettings.puml
@startuml
SafeHttpServerClientApplicationSettings --> SafeApplicationSettings
SafeApplicationSettings --> IApplicationSettings
@enduml
